Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: You should also modify the ``[PATCH]`` tag in the email subject line when sending the revised patch to mark the new iteration as ``[PATCH v2]``, ``[PATCH v3]``, etc as appropriate. This can be done by passing the ``-v`` argument to ``git format-patch`` with a version number::
it_it: Si deve anche modificare il tag ``[PATCH]`` nell'oggetto dell'email quando si invia la patch rivista per contrassegnare la nuova iterazione come ``[PATCH v2]``, ``[PATCH v3]``, ecc. a seconda dei casi. Questo può essere fatto passando l'argomento ``-v`` a ``git format-patch`` con un numero di versione::

source: You should have warnings from :term:`BitBake` printed on the console:
it_it: Dovrebbero essere visualizzati dei warning da :term:`BitBake` sulla console:

source: You should place recipes (``*.bb`` files) and recipe modifications (``*.bbappend`` files) into ``recipes-*`` subdirectories by functional area as outlined in ``recipes.txt``. If you cannot find a category in ``recipes.txt`` to fit a particular recipe, you can make up your own ``recipes-*`` subdirectory.
it_it: È necessario posizionare le ricette (file ``*.bb``) e le modifiche alle ricette (file ``*.bbappend``) nelle sottocartelle ``recipes-*`` in base all'area funzionale, come descritto in ``recipes.txt``. Se non si trova una categoria in ``recipes.txt`` adatta a una particolare ricetta, è possibile creare una propria sottocartella ``recipes-*``.

source: You should see the trace events and summary just as you would have if you'd run the same command on the target.
it_it: Si dovrebbero vedere gli eventi di traccia e il riepilogo esattamente come se fosse stato eseguito lo stesso comando sul target.

source: You should send patches to the appropriate mailing list so that they can be reviewed by the right contributors and merged by the appropriate maintainer. The specific mailing list you need to use depends on the location of the code you are changing.
it_it: È necessario inviare le patch alla mailing list appropriata affinché possano essere esaminate dai collaboratori competenti e integrate dal manutentore di riferimento. La mailing list specifica da utilizzare dipende dalla posizione del codice che si sta modificando.

source: You use different layers to logically separate information in your build. As an example, you could have BSP, GUI, distro configuration, middleware, or application layers. Putting your entire build into one layer limits and complicates future customization and reuse. Isolating information into layers, on the other hand, helps simplify future customizations and reuse. You might find it tempting to keep everything in one layer when working on a single project. However, the more modular your Metadata, the easier it is to cope with future changes.
it_it: Si utilizzano layer diversi per separare logicamente le informazioni nella build. Ad esempio, si potrebbero avere layer per BSP, GUI, configurazione della distribuzione, middleware o applicazione. Inserire l'intera build in un unico layer limita e complica la personalizzazione e il riutilizzo futuri. Isolare le informazioni in layer, d'altra parte, aiuta a semplificare le personalizzazioni e il riutilizzo futuri. Potrebbe essere allettante mantenere tutto in un unico layer quando si lavora su un singolo progetto. Tuttavia, maggiore è la modularità dei metadati, più facile sarà gestire le modifiche future.

source: You use the ``orm/fixtures/custom.xml`` file to change the default project settings for the machine, distro, file images, and layers. When creating a new project, you can use the file to define the offered alternate project release selections. For example, you can add one or more additional selections that present custom layer sets or distros, and any other local or proprietary content.
it_it: Il file ``orm/fixtures/custom.xml`` viene utilizzato per modificare le impostazioni di default del progetto per la macchina, la distribuzione, le immagini dei file e i layer. Quando si crea un nuovo progetto, è possibile utilizzare il file per definire le opzioni alternative di rilascio del progetto. Ad esempio, è possibile aggiungere una o più opzioni aggiuntive che presentano set di layer o distribuzioni personalizzati e qualsiasi altro contenuto locale o proprietario.

source: You will also need to use a :term:`buildtools` tarball which provides a set of basic host tools with fixed versions. Follow the :ref:`system-requirements-buildtools` section below to learn how to download and install this tarball.
it_it: Sarà inoltre necessario utilizzare un file tarball :term:`buildtools` che fornisce una serie di strumenti host di base con versioni fisse. Seguire la sezione :ref:`system-requirements-buildtools` di seguito per scoprire come scaricare e installare questo file tarball.

source: You will manage to build an image such as ``core-image-sato`` for the ``qemux86-64`` machine with as little as 32 Gbytes of RAM on an old system with 4 CPU cores, but your builds will be much faster on a system with as much RAM and as many CPU cores as possible.
it_it: Sarà possibile creare un'immagine come ``core-image-sato`` per la macchina ``qemux86-64`` con soli 32 GB di RAM su un vecchio sistema con 4 core CPU, ma le build saranno molto più veloci su un sistema con la massima quantità di RAM e il maggior numero possibile di core CPU.

source: You will see that ``git send-email`` will automatically copy the people listed in any commit tags such as ``Signed-off-by`` or ``Reported-by``.
it_it: Si noterà che ``git send-email`` invierà automaticamente una copia a tutti i destinatari indicati nei tag di commit, come ``Signed-off-by`` o ``Reported-by``.

source: You would use the ``linux-yocto_6.12.bbappend`` file to append specific BSP settings to the kernel, thus configuring the kernel for your particular BSP.
it_it: Il file ``linux-yocto_6.12.bbappend`` viene utilizzato per aggiungere impostazioni BSP specifiche al kernel, configurando così il kernel per il proprio BSP specifico.

source: You'll notice the short-form of the key identifier here, which are the last 16 characters of the long-form key identifier shown with ``gpg --list-keys`` (in bold text below):
it_it: Si noterà qui la forma abbreviata dell'identificativo della chiave, ovvero gli ultimi 16 caratteri dell'identificativo della chiave in forma estesa mostrato con ``gpg --list-keys`` (in grassetto qui sotto):

source: `Debugging the kernel using ftrace - part 1 <https://lwn.net/Articles/365835/>`__
it_it: `Debug del kernel con ftrace - parte 1 <https://lwn.net/Articles/365835/>`__

source: `Debugging the kernel using ftrace - part 2 <https://lwn.net/Articles/366796/>`__
it_it: `Debug del kernel con ftrace - parte 2 <https://lwn.net/Articles/366796/>`__

source: `Secrets of the ftrace function tracer <https://lwn.net/Articles/370423/>`__
it_it: `Segreti del tracer di funzioni ftrace <https://lwn.net/Articles/370423/>`__

source: `Technical Overview (external website) <https://www.yoctoproject.org/development/technical-overview/>`__
it_it: `Panoramica Tecnica (sito web esterno) <https://www.yoctoproject.org/development/technical-overview/>`__

source: `Tips and Tricks Wiki (external website) <https://wiki.yoctoproject.org/wiki/TipsAndTricks>`__
it_it: `Wiki di Suggerimenti e Trucchi (sito web esterno) <https://wiki.yoctoproject.org/wiki/TipsAndTricks>`__

source: ``${WORKDIR}/build``: This subdirectory applies only to recipes that support builds where the source is separate from the build artifacts. The OpenEmbedded build system uses this directory as a separate build directory (i.e. ``${``\ :term:`B`\ ``}``).
it_it: ``${WORKDIR}/build``: Questa sottocartella si applica solo alle ricette che supportano build in cui il codice sorgente è separato dagli artefatti di build. Il sistema di build OpenEmbedded utilizza questa directory come directory di build separata (ovvero ``${``\ :term:`B`\ ``}``).

source: ``${WORKDIR}/image``: Contains the output of the :ref:`ref-tasks-install` task, which corresponds to the ``${``\ :term:`D`\ ``}`` variable in that task.
it_it: ``${WORKDIR}/image``: Contiene l'output dei task :ref:`ref-tasks-install`, che corrisponde alla variabile ``${``\ :term:`D`\ ``}`` in tale task.

source: ``${WORKDIR}/package``: Contains the output of the :ref:`ref-tasks-package` task before the output is split into individual packages.
it_it: ``${WORKDIR}/package``: Contiene l'output del task :ref:`ref-tasks-package` prima che venga suddiviso in singoli pacchetti.

source: ``${WORKDIR}/packages-split``: Contains the output of the :ref:`ref-tasks-package` task after the output has been split into individual packages. There are subdirectories for each individual package created by the recipe.
it_it: ``${WORKDIR}/packages-split``: Contiene l'output del task :ref:`ref-tasks-package` dopo che è stato suddiviso in singoli pacchetti. Esistono sottocartelle per ogni singolo pacchetto creato dalla ricetta.

source: ``${WORKDIR}/pseudo``: Contains the pseudo database and log for any tasks executed under pseudo for the recipe.
it_it: ``${WORKDIR}/pseudo``: Contiene il database pseudo e il log per tutti i task eseguiti in ambiente pseudo per la ricetta.

source: ``${WORKDIR}/recipe-sysroot-native``: A directory populated with the native dependencies of the recipe. This directory contains the tools the recipe needs to build (e.g. the compiler, Autoconf, libtool, and so forth).
it_it: ``${WORKDIR}/recipe-sysroot-native``: Una directory contenente le dipendenze native della ricetta. Questa directory contiene i tool necessari alla ricetta per la compilazione (ad esempio, il compilatore, Autoconf, libtool e così via).

source: ``${WORKDIR}/recipe-sysroot``: A directory populated with the target dependencies of the recipe. This directory looks like the target filesystem and contains libraries that the recipe might need to link against (e.g. the C library).
it_it: ``${WORKDIR}/recipe-sysroot``: Una directory contenente le dipendenze dal target della ricetta. Questa directory ha la stessa struttura del filesystem target e contiene le librerie che la ricetta potrebbe dover linkare (ad esempio, la libreria C).

source: ``${WORKDIR}/sysroot-destdir``: Contains the output of the :ref:`ref-tasks-populate_sysroot` task.
it_it: ``${WORKDIR}/sysroot-destdir``: Contiene l'output del task :ref:`ref-tasks-populate_sysroot`.

source: ``${WORKDIR}/temp``: Contains the log files of each task executed for this recipe, the "run" files for each executed task, which contain the code run, and a ``log.task_order`` file, which lists the order in which tasks were executed.
it_it: ``${WORKDIR}/temp``: Contiene i file di log di ogni task eseguito per questa ricetta, i file "run" per ogni task eseguito, che contengono il codice eseguito, e un file ``log.task_order``, che elenca l'ordine in cui sono state eseguiti i task.

source: ``<fragment>`` is the name of the built-in fragment.
it_it: ``<fragment>`` è il nome del frammento integrato.

source: ``<variable name>`` is the name of the variable to be modified by this fragment.
it_it: ``<variable name>`` è il nome della variabile da modificare tramite questo frammento.

source: ``BB_BASEHASH:task-``\ taskname: The base hashes for each task in the recipe.
it_it: ``BB_BASEHASH:task-``\ taskname: Gli hash di base per ogni task nella ricetta.

source: ``BB_BASEHASH_``\ filename\ ``:``\ taskname: The base hashes for each dependent task.
it_it: ``BB_BASEHASH_``\ filename\ ``:``\ taskname: Gli hash di base per ogni task dipendente.

source: ``Cc``: name and email of people you want to send a copy of your changes to. This field will be used by ``git send-email``.
it_it: ``Cc``: nome e indirizzo email delle persone a cui inviare una copia delle modifiche. Questo campo verrà utilizzato da ``git send-email``.

source: ``DEPLOY_DIR_*``: Depending on the package manager used, the package type sub-folder. Given RPM, IPK, or DEB packaging and tarball creation, the :term:`DEPLOY_DIR_RPM`, :term:`DEPLOY_DIR_IPK`, or :term:`DEPLOY_DIR_DEB` variables are used, respectively.
it_it: ``DEPLOY_DIR_*``: A seconda del gestore di pacchetti utilizzato, la sottocartella del tipo di pacchetto. In caso di creazione di pacchetti RPM, IPK o DEB e di archivi tarball, vengono utilizzate rispettivamente le variabili :term:`DEPLOY_DIR_RPM`, :term:`DEPLOY_DIR_IPK` o :term:`DEPLOY_DIR_DEB`.

source: ``Ignored`` means that after analysis, it has been deemed to ignore the issue as it for example affects the software component on a different operating system platform.
it_it: ``Ignored`` significa che, dopo l'analisi, si è ritenuto opportuno ignorare il problema, ad esempio perché interessa il componente software su una piattaforma di sistema operativo diversa.

source: ``LICENSE``: This is the license associated with this library
it_it: ``LICENSE``: Questa è la licenza associata a questa libreria

source: ``LICENSE``: This is the license associated with this project
it_it: ``LICENSE``: Questa è la licenza associata a questo progetto

source: ``Makefile``: The file used by ``make`` to build the library
it_it: ``Makefile``: Il file utilizzato da ``make`` per compilare la libreria

source: ``Makefile``: The file used by ``make`` to build the project
it_it: ``Makefile``: Il file utilizzato da ``make`` per compilare il progetto

source: ``Patched`` means that a patch file to address the security issue has been applied.
it_it: ``Patched`` significa che è stato applicato un file di patch per risolvere il problema di sicurezza.

source: ``Reported-by``: name and email of a person reporting a bug that your commit is trying to fix. This is a good practice to encourage people to go on reporting bugs and let them know that their reports are taken into account.
it_it: ``Reported-by``: nome e indirizzo email della persona che ha segnalato un bug che il commit sta cercando di correggere. Questa è una buona pratica per incoraggiare gli utenti a continuare a segnalare bug e far loro sapere che le loro segnalazioni vengono prese in considerazione.

source: ``Suggested-by``: name and email of a person to credit for the idea of making the change.
it_it: ``Suggested-by``: nome e indirizzo email della persona a cui attribuire il merito dell'idea di apportare la modifica.

source: ``Tested-by``, ``Reviewed-by``: name and email for people having tested your changes or reviewed their code. These fields are usually added by the maintainer accepting a patch, or by yourself if you submitted your patches to early reviewers, or are submitting an unmodified patch again as part of a new iteration of your patch series.
it_it: ``Tested-by``, ``Reviewed-by``: nome e indirizzo email delle persone che hanno testato le modifiche o revisionato il codice. Questi campi vengono solitamente aggiunti dal manutentore che accetta una patch, oppure in proprio se si è il mittente delle patch a dei revisori preliminari o se si sta inviando nuovamente una patch non modificata come parte di una nuova iterazione della propria serie di patch.

source: ``Unpatched`` means that no patches to address the issue have been applied and that the issue needs to be investigated.
it_it: ``Unpatched`` significa che non sono state applicate patch per risolvere il problema e che è necessario indagare sul problema stesso.

source: ``bitbake-selftest``: A standalone command that runs unit tests on key pieces of BitBake and its fetchers.
it_it: ``bitbake-selftest``: Un comando standalone che esegue unit test su componenti chiave di BitBake e sui suoi fetcher.

source: ``bitbake-selftest``: for changes within BitBake
it_it: ``bitbake-selftest``: per le modifiche all'interno di BitBake

source: ``cd`` into that directory to see the output files::
it_it: Accedere a tale directory con ``cd`` per visualizzare i file di output::

source: ``classes-global/`` - classes intended to be inherited globally
it_it: ``classes-global/`` - classi destinate a essere ereditate globalmente

source: ``classes-recipe/`` - classes intended to be inherited by recipes individually
it_it: ``classes-recipe/`` - classi destinate a essere ereditate singolarmente dalle ricette

source: ``classes/`` - classes whose usage context is not clearly defined
it_it: ``classes/`` - classi il cui contesto di utilizzo non è chiaramente definito

source: ``depchains``: If a package ``foo`` depends on a package ``bar``, then ``foo-dev`` and ``foo-dbg`` are also made to depend on ``bar-dev`` and ``bar-dbg``, respectively. Taking the ``-dev`` packages as an example, the ``bar-dev`` package might provide headers and shared library symlinks needed by ``foo-dev``, which shows the need for a dependency between the packages.
it_it: ``depchains``: Se un pacchetto ``foo`` dipende da un pacchetto ``bar``, allora anche ``foo-dev`` e ``foo-dbg`` diventano dipendenti rispettivamente da ``bar-dev`` e ``bar-dbg``. Prendendo come esempio i pacchetti ``-dev``, il pacchetto ``bar-dev`` potrebbe fornire i file header e i link simbolici alle librerie shared necessari a ``foo-dev``, il che dimostra la necessità di una dipendenza tra i pacchetti. Le dipendenze aggiunte da, il che dimostra la necessità di una dipendenza tra i pacchetti.

source: ``distro/poky`` sets the :term:`DISTRO` to :term:`Poky` (:ref:`ref-fragments-builtin-core-distro` fragment).
it_it: ``distro/poky`` imposta :term:`DISTRO` a :term:`Poky` (frammento :ref:`ref-fragments-builtin-core-distro`).

source: ``do_image_wic[depends]``: A task that is constructed during the build. In this example, the task depends on specific tools in order to create the sysroot when building a Wic image.
it_it: ``do_image_wic[depends]``: Un task che viene creato durante la compilazione. In questo esempio, il task dipende da strumenti specifici per creare il sysroot durante la compilazione di un'immagine Wic.

source: ``gcc``: The compiler, GNU Compiler Collection (GCC), provided by the :term:`Build Host`, or by a :term:`buildtools` tarball.
it_it: ``gcc``: Il compilatore, GNU Compiler Collection (GCC), fornito dal :term:`Build Host` o da un tarball di :term:`buildtools`.

source: ``hellolib.c``: The implementation of the library
it_it: ``hellolib.c``: L'implementazione della libreria

source: ``hellolib.h``: The C header of the library
it_it: ``hellolib.h``: Il file header C della libreria

source: ``libgcc-initial``: An initial version of the GCC support library needed to bootstrap ``virtual/libc``.
it_it: ``libgcc-initial``: Una versione iniziale della libreria di supporto GCC necessaria per avviare ``virtual/libc``.

source: ``libgcc``: The final version of the GCC support library which can only be built once there is a C library to link against.
it_it: ``libgcc``: La versione finale della libreria di supporto GCC, che può essere compilata solo se è disponibile una libreria C a cui collegarsi [link].

source: ``libhello`` sources are as follows:
it_it: I sorgenti di ``libhello`` sono i seguenti:

source: ``libhello``: A recipe that provides a shared library
it_it: ``libhello``: Una ricetta che fornisce una libreria shared

source: ``linux-libc-headers``: Headers needed for the cross-compiler and C library build.
it_it: ``linux-libc-headers``: File header necessari per il cross-compilatore e la compilazione della libreria C.

source: ``machine/qemux86-64`` sets the :term:`MACHINE` to ``qemux86-64`` (:ref:`ref-fragments-builtin-core-machine` fragment).
it_it: ``machine/qemux86-64`` imposta :term:`MACHINE` a ``qemux86-64`` (frammento :ref:`ref-fragments-builtin-core-machine`).

source: ``oe specific``: the issue is specific to how OpenEmbedded performs builds or sets things up at runtime, and can be resolved only with a patch that is not however relevant or appropriate for general upstream submission.
it_it: ``oe specific``: il problema è specifico del modo in cui OpenEmbedded esegue le build o configura le cose in fase di runtime e può essere risolto solo con una patch che, tuttavia, non è rilevante o appropriata per l'invio generale al progetto upstream.

source: ``oe-build-perf-test``: to test the performance of common build scenarios
it_it: ``oe-build-perf-test``: per testare le prestazioni di scenari di compilazione comuni

source: ``oe-selftest``: Tests combinations of BitBake invocations. These tests operate outside the OpenEmbedded build system itself. The ``oe-selftest`` can run all tests by default or can run selected tests or test suites.
it_it: ``oe-selftest``: Testa combinazioni di invocazioni di BitBake. Questi test operano al di fuori del sistema di compilazione di OpenEmbedded. ``oe-selftest`` può eseguire tutti i test per default oppure test o suite di test selezionati.

source: ``oe-selftest``: to test combinations of BitBake runs
it_it: ``oe-selftest``: per testare combinazioni di esecuzioni di BitBake

source: ``patchtest`` is available in ``openembedded-core`` as a tool for making sure that your patches are well-formatted and contain important info for maintenance purposes, such as the ``Signed-off-by`` presence. Note that no functional testing of the changes will be performed by ``patchtest``. Currently, it only supports testing patches for ``openembedded-core`` branches. To setup, perform the following::
it_it: ``patchtest`` è disponibile in ``openembedded-core`` come strumento per garantire che le patch siano ben formattate e contengano informazioni importanti per la manutenzione, come la presenza di ``Signed-off-by``. Si noti che ``patchtest`` non eseguirà alcun test funzionale delle modifiche. Attualmente, supporta solo il test delle patch per i branch di ``openembedded-core``. Per configurarlo, procedere come segue::

source: ``pcdeps``: During the :ref:`ref-tasks-package` task of each recipe, all pkg-config modules (``*.pc`` files) installed by the recipe are located. For each module, the package that contains the module is registered as providing the module. The resulting module-to-package mapping is saved globally in :term:`PKGDATA_DIR` by the :ref:`ref-tasks-packagedata` task.
it_it: ``pcdeps``: Durante il task :ref:`ref-tasks-package` di ogni ricetta, vengono individuati tutti i moduli pkg-config (file``*.pc``) installati dalla ricetta. Per ogni modulo, il pacchetto che lo contiene viene registrato come fornitore del modulo. La mappatura modulo-pacchetto risultante viene salvata globalmente in :term:`PKGDATA_DIR` dal task :ref:`ref-tasks-packagedata`.

source: ``ptest``: run package specific tests, if they exist
it_it: ``ptest``: esegue test specifici del pacchetto, se presenti

source: ``recipe-sysroot-native``: contains host-native executables with their libraries and other data, so that they can be run directly on the build host when that is required by the build process
it_it: ``recipe-sysroot-native``: contiene eseguibili nativi dell'host con le relative librerie e altri dati, in modo che possano essere eseguiti direttamente sull'host di build quando richiesto dal processo di compilazione.

source: ``recipe-sysroot``: contains target libraries, and associated headers and other data needed to cross-build software from its sources
it_it: ``recipe-sysroot``: contiene le librerie target, i relativi file header e altri dati necessari per la cross-compilazione del software a partire dai suoi sorgenti

source: ``sayhello.c``: The source file of the project
it_it: ``sayhello.c``: Il file sorgente del progetto
